import React from "react";

function Transportation() {
    return(
        <section className="transportation">
            <div className="container">
                <div className="transportation__inner">
                    <div className="transportation__block">
                        <div className="transportation__item">
                            <div className="transportation__item-left">                        
                            <svg className="transportation__item-icon" width="38" height="40" viewBox="0 0 38 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M30.2936 15.0062C30.1436 14.798 29.9109 14.6758 29.6643 14.6758H24.7692C24.3316 14.6758 23.9775 15.0513 23.9775 15.5154V21.1003C23.9775 21.5644 24.3316 21.9399 24.7692 21.9399H31.7176C32.1552 21.9399 32.5093 21.5644 32.5093 21.1003V18.3706C32.5093 18.1869 32.452 18.0073 32.3469 17.8614L30.2936 15.0062ZM30.926 20.2606H25.5608V16.3551H29.2724L30.926 18.6543V20.2606Z"/>
                            <path d="M36.0332 24.0782V17.1053C36.0332 16.9209 35.976 16.7421 35.8709 16.5961L32.0364 11.2679C31.8864 11.0597 31.6537 10.9375 31.4071 10.9375H21.2449C20.8074 10.9375 20.4533 11.313 20.4533 11.7772V23.9981H0.793099C0.355536 23.9981 0.00146484 24.3736 0.00146484 24.8377V32.361C0.00146484 32.8251 0.355536 33.2006 0.793099 33.2006H4.20746C4.58443 35.4908 6.46814 37.239 8.73341 37.239C10.9979 37.239 12.8811 35.492 13.259 33.2031H24.7346C25.1125 35.492 26.9957 37.239 29.2602 37.239C31.5297 37.239 33.4169 35.4908 33.7946 33.2006H37.2083C37.6458 33.2006 37.9999 32.8251 37.9999 32.361V26.7097C37.9999 25.4311 37.158 24.3625 36.0332 24.0782ZM22.0366 12.6168H31.0151L34.4499 17.3891V23.9981H22.0366V12.6168ZM8.73341 35.5597C7.07051 35.5597 5.71762 34.1247 5.71762 32.361C5.71762 30.5964 7.07051 29.1614 8.73341 29.1614C10.3963 29.1614 11.7492 30.5964 11.7492 32.361C11.7492 34.1247 10.3963 35.5597 8.73341 35.5597ZM29.2602 35.5597C27.5987 35.5597 26.2472 34.1271 26.2449 32.3653C26.2449 32.3647 26.2452 32.3641 26.2452 32.3634C26.2452 32.3622 26.2446 32.3611 26.2446 32.3599C26.2451 30.5958 27.5977 29.1614 29.2602 29.1614C30.9234 29.1614 32.2761 30.5892 32.2832 32.3473C32.2831 32.3522 32.2807 32.3562 32.2807 32.361C32.2807 32.3657 32.2831 32.3696 32.2832 32.3744C32.2762 34.1318 30.9234 35.5597 29.2602 35.5597ZM36.4166 31.5213H33.7946C33.417 29.2305 31.5298 27.4821 29.2602 27.4821C26.9949 27.4821 25.1112 29.2305 24.7342 31.5213H13.2594C12.8825 29.2305 10.9988 27.4821 8.73341 27.4821C6.46804 27.4821 4.58433 29.2305 4.20741 31.5213H1.58473V25.6774H21.2449H35.2416H35.4433C35.9799 25.6774 36.4166 26.1406 36.4166 26.7097V31.5213Z"/>
                            <path d="M9.50531 0C4.85987 0 1.08105 4.00804 1.08105 8.93526C1.08105 15.0531 8.65647 22.268 8.97962 22.5723C9.1296 22.7141 9.31745 22.7846 9.50531 22.7846C9.69317 22.7846 9.88103 22.7141 10.031 22.5723C10.3542 22.268 17.9296 15.0531 17.9296 8.93526C17.9296 4.00804 14.1508 0 9.50531 0ZM9.50531 20.7946C7.81922 19.0742 2.66432 13.4451 2.66432 8.93526C2.66432 4.93461 5.73345 1.67931 9.50531 1.67931C13.2772 1.67931 16.3463 4.93461 16.3463 8.93526C16.3463 13.4451 11.1914 19.0742 9.50531 20.7946Z"/>
                            <path d="M9.50574 4.85547C7.38518 4.85547 5.65967 6.68565 5.65967 8.93484C5.65967 11.184 7.38518 13.0142 9.50574 13.0142C11.6263 13.0142 13.3518 11.184 13.3518 8.93484C13.3518 6.68565 11.6263 4.85547 9.50574 4.85547ZM9.50574 11.3349C8.25799 11.3349 7.24294 10.2583 7.24294 8.93484C7.24294 7.6114 8.25799 6.53478 9.50574 6.53478C10.7535 6.53478 11.7685 7.6114 11.7685 8.93484C11.7685 10.2583 10.7535 11.3349 9.50574 11.3349Z"/>
                            <path d="M2.9006 38.3203H0.791634C0.354071 38.3203 0 38.6959 0 39.16C0 39.6241 0.354071 39.9996 0.791634 39.9996H2.9006C3.33816 39.9996 3.69223 39.6241 3.69223 39.16C3.69223 38.6959 3.33816 38.3203 2.9006 38.3203Z"/>
                            <path d="M8.61837 38.3203H6.50941C6.07184 38.3203 5.71777 38.6959 5.71777 39.16C5.71777 39.6241 6.07184 39.9996 6.50941 39.9996H8.61837C9.05594 39.9996 9.41001 39.6241 9.41001 39.16C9.41001 38.6959 9.05594 38.3203 8.61837 38.3203Z"/>
                            <path d="M14.3357 38.3203H12.2267C11.7891 38.3203 11.4351 38.6959 11.4351 39.16C11.4351 39.6241 11.7891 39.9996 12.2267 39.9996H14.3357C14.7732 39.9996 15.1273 39.6241 15.1273 39.16C15.1273 38.6959 14.7732 38.3203 14.3357 38.3203Z"/>
                            <path d="M20.0534 38.3203H17.9445C17.5069 38.3203 17.1528 38.6959 17.1528 39.16C17.1528 39.6241 17.5069 39.9996 17.9445 39.9996H20.0534C20.491 39.9996 20.8451 39.6241 20.8451 39.16C20.8451 38.6959 20.491 38.3203 20.0534 38.3203Z"/>
                            <path d="M25.7717 38.3203H23.6627C23.2252 38.3203 22.8711 38.6959 22.8711 39.16C22.8711 39.6241 23.2252 39.9996 23.6627 39.9996H25.7717C26.2093 39.9996 26.5633 39.6241 26.5633 39.16C26.5633 38.6959 26.2093 38.3203 25.7717 38.3203Z"/>
                            <path d="M31.489 38.3203H29.38C28.9424 38.3203 28.5884 38.6959 28.5884 39.16C28.5884 39.6241 28.9424 39.9996 29.38 39.9996H31.489C31.9265 39.9996 32.2806 39.6241 32.2806 39.16C32.2806 38.6959 31.9265 38.3203 31.489 38.3203Z"/>
                            <path d="M37.2068 38.3203H35.0978C34.6602 38.3203 34.3062 38.6959 34.3062 39.16C34.3062 39.6241 34.6602 39.9996 35.0978 39.9996H37.2068C37.6443 39.9996 37.9984 39.6241 37.9984 39.16C37.9984 38.6959 37.6443 38.3203 37.2068 38.3203Z"/>
                            </svg>
                            <p className="transportation__item-text">Автомобильные перевозки</p>
                            </div>                            
                            <div className="transportation__item-arrow">                          
                            <svg width="12" height="11" viewBox="0 0 28 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M23.1858 11.2474C22.834 11.2474 22.6111 11.2474 22.3883 11.2474C15.5511 11.2474 8.71386 11.2474 1.8649 11.2474C1.66553 11.2474 1.47789 11.2592 1.27852 11.2474C0.50449 11.1888 0.0119279 10.708 0.000200284 9.99259C-0.0115274 9.28893 0.492762 8.77291 1.25506 8.726C1.43098 8.71427 1.60689 8.726 1.78281 8.726C8.64349 8.726 15.5042 8.726 22.3649 8.726C22.5877 8.726 22.8222 8.726 23.1741 8.726C22.9512 8.49145 22.8222 8.32726 22.6815 8.18653C20.6878 6.19283 18.7058 4.21085 16.7121 2.21715C16.243 1.73631 16.1375 1.18511 16.4072 0.669097C16.6769 0.164807 17.1226 -0.0814739 17.6738 0.0240751C17.9553 0.0827134 18.2719 0.246901 18.4713 0.446271C21.3446 3.29609 24.2061 6.15764 27.0677 9.03092C27.6775 9.64076 27.6775 10.3327 27.0677 10.9425C24.1944 13.8275 21.3211 16.7008 18.4478 19.5624C17.8849 20.1253 17.1226 20.137 16.6183 19.6445C16.0788 19.1167 16.1023 18.3779 16.7004 17.7798C18.6824 15.7861 20.6761 13.7924 22.6698 11.8104C22.8105 11.6579 22.9512 11.5055 23.1858 11.2474Z" fill="#fff"/>
                            </svg>
                            </div> 
                        </div>
                        <div className="transportation__item">                                                      
                            <svg className="transportation__item-icon" width="35" height="40" viewBox="0 0 35 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M0.392303 30.2859L17.1077 39.8953C17.2291 39.9651 17.3645 40 17.5 40C17.6355 40 17.7709 39.9651 17.8923 39.8953L34.6077 30.2859C34.8505 30.1464 35 29.8885 35 29.6094V10.3906C35 10.1115 34.8505 9.85356 34.6077 9.71403L17.8923 0.104649C17.6495 -0.0348829 17.3505 -0.0348829 17.1077 0.104649L0.392303 9.71403C0.149546 9.85356 0 10.1115 0 10.3906V29.6094C0 29.8885 0.149546 30.1464 0.392303 30.2859ZM1.56921 12.5153L16.7154 21.2225V37.8656L1.56921 29.1583V12.5153ZM6.12236 8.22411L21.9396 17.3171L17.5 19.8694L1.68282 10.7764L6.12236 8.22411ZM11.9284 4.88629L27.7456 13.9793L23.5087 16.4151L7.69157 7.322L11.9284 4.88629ZM24.2934 17.7682L28.5302 15.3325V21.6699L27.1527 20.6766C26.9751 20.5486 26.7518 20.5005 26.537 20.5436C26.3221 20.5869 26.1352 20.7176 26.0216 20.9043L24.2934 23.7426L24.2934 17.7682ZM18.2846 37.8656V21.2225L22.7241 18.6703V26.5381C22.7241 26.8886 22.9586 27.1962 23.2976 27.2905C23.3677 27.3101 23.4386 27.3194 23.5087 27.3194C23.778 27.3194 24.0349 27.1809 24.1797 26.9432L26.9219 22.4395L28.8546 23.8331C29.0933 24.0053 29.409 24.0297 29.6715 23.8962C29.9341 23.7628 30.0994 23.494 30.0994 23.2004V14.4304L33.4307 12.5152V29.1583L18.2846 37.8656ZM17.5 1.68332L33.3172 10.7764L29.3148 13.0772L13.4976 3.98418L17.5 1.68332Z"/>
                            </svg>
                            <p className="transportation__item-text">Мультимодальные перевозки</p>                           
                            <div className="transportation__item-arrow">                          
                            <svg width="12" height="11" viewBox="0 0 28 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M23.1858 11.2474C22.834 11.2474 22.6111 11.2474 22.3883 11.2474C15.5511 11.2474 8.71386 11.2474 1.8649 11.2474C1.66553 11.2474 1.47789 11.2592 1.27852 11.2474C0.50449 11.1888 0.0119279 10.708 0.000200284 9.99259C-0.0115274 9.28893 0.492762 8.77291 1.25506 8.726C1.43098 8.71427 1.60689 8.726 1.78281 8.726C8.64349 8.726 15.5042 8.726 22.3649 8.726C22.5877 8.726 22.8222 8.726 23.1741 8.726C22.9512 8.49145 22.8222 8.32726 22.6815 8.18653C20.6878 6.19283 18.7058 4.21085 16.7121 2.21715C16.243 1.73631 16.1375 1.18511 16.4072 0.669097C16.6769 0.164807 17.1226 -0.0814739 17.6738 0.0240751C17.9553 0.0827134 18.2719 0.246901 18.4713 0.446271C21.3446 3.29609 24.2061 6.15764 27.0677 9.03092C27.6775 9.64076 27.6775 10.3327 27.0677 10.9425C24.1944 13.8275 21.3211 16.7008 18.4478 19.5624C17.8849 20.1253 17.1226 20.137 16.6183 19.6445C16.0788 19.1167 16.1023 18.3779 16.7004 17.7798C18.6824 15.7861 20.6761 13.7924 22.6698 11.8104C22.8105 11.6579 22.9512 11.5055 23.1858 11.2474Z" fill="#fff"/>
                            </svg>
                            </div> 
                        </div>
                        <div className="transportation__item">                                                     
                            <svg className="transportation__item-icon" width="40" height="39" viewBox="0 0 40 39" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M37.2699 24.0964L38.3571 23.0351C39.0414 22.3666 39.0414 21.2792 38.3571 20.6108C38.0254 20.2872 37.5847 20.1088 37.1156 20.1088C36.7636 20.1088 36.4273 20.2093 36.1414 20.3964L35.9124 19.6456L37.0892 18.4962C37.7738 17.8277 37.7738 16.7403 37.0892 16.0722C36.4592 15.4567 35.4659 15.4094 34.7779 15.9272L33.3833 11.3555C33.9402 10.8317 34.4737 10.3221 34.9765 9.83121C36.4253 8.4162 37.6033 6.91882 38.2936 5.61423C39.46 3.40934 38.9718 2.23074 38.3568 1.63026C37.7422 1.02977 36.5352 0.553295 34.2769 1.69226C32.9411 2.36607 31.4074 3.51636 29.9586 4.93136C29.4558 5.42228 28.9336 5.94293 28.3975 6.48679L23.7154 5.12501C24.2457 4.45347 24.1972 3.48352 23.5672 2.86803C22.8827 2.19988 21.769 2.1996 21.0848 2.86803L19.9076 4.01747L19.1384 3.79381C19.3301 3.51438 19.433 3.18597 19.433 2.84227C19.433 2.38447 19.2504 1.95386 18.919 1.63026C18.2347 0.961827 17.1208 0.961827 16.4365 1.63026L15.3496 2.69165L9.80918 1.08017C9.61173 1.02298 9.39834 1.07564 9.25308 1.21776L7.82689 2.6104C7.5874 2.84397 7.61901 3.24344 7.89213 3.4385L21.8711 13.4299C18.7192 16.9 15.683 20.3744 13.5395 22.8567L9.42763 21.3123C9.2209 21.2347 8.98692 21.2831 8.83036 21.436L7.14003 23.0866C6.92142 23.3003 6.92142 23.6466 7.14003 23.86L15.5914 32.1125C15.8071 32.3234 16.1678 32.3234 16.3838 32.1125L18.0738 30.4622C18.2304 30.3094 18.2802 30.0806 18.2005 29.8788L16.6192 25.8639C19.1613 23.7709 22.7191 20.8061 26.2732 17.7281L27.3836 19.2099C27.5808 19.4729 27.9806 19.5069 28.2224 19.2827C28.4239 19.0958 28.4518 18.7824 28.2879 18.5638L27.114 16.9977C28.9725 15.378 30.8078 13.7438 32.4729 12.204L37.7512 29.5065L37.0231 30.2171L29.7686 20.5391C29.586 20.2954 29.2355 20.2424 28.9858 20.4208C28.7359 20.5994 28.6817 20.9417 28.8646 21.1855L36.5053 31.3784C36.7051 31.6451 37.1142 31.676 37.3534 31.4421L38.7796 30.0495C38.9251 29.9076 38.979 29.699 38.9205 29.5065L37.2699 24.0964ZM21.8772 3.64178C22.1219 3.40283 22.5304 3.40283 22.7751 3.64178C23.0227 3.88356 23.0227 4.2768 22.7751 4.51858L22.5124 4.77508L21.1286 4.37249L21.8772 3.64178ZM17.2289 2.40401C17.4762 2.16223 17.8793 2.16223 18.1269 2.40401C18.3745 2.64579 18.3745 3.03903 18.1269 3.28081L17.9541 3.44926L16.5705 3.04696L17.2289 2.40401ZM9.08115 2.93258L9.80918 2.22197L27.5286 7.37576C25.9516 9.00197 24.2781 10.7941 22.6191 12.6088L9.08115 2.93258ZM9.36529 22.4612L12.7764 23.7423C11.9208 24.7371 11.2647 25.5069 10.8776 25.9624L8.32848 23.4733L9.36529 22.4612ZM11.6735 26.7396C13.6265 24.4387 23.9496 12.3461 30.7509 5.70483C32.1003 4.38693 33.5732 3.27883 34.7912 2.66447C35.7057 2.203 36.9292 1.78342 37.5647 2.40401C38.2003 3.02459 37.7703 4.21933 37.298 5.11227C36.6688 6.30163 35.5337 7.73956 34.1841 9.05746C27.3833 15.6982 14.999 25.7787 12.6427 27.686L11.6735 26.7396ZM17.0242 29.9399L15.9877 30.952L13.4386 28.4629C13.9048 28.0852 14.6934 27.4445 15.7123 26.6091L17.0242 29.9399ZM36.6668 21.3845C36.9144 21.1427 37.3171 21.1427 37.5647 21.3845C37.8123 21.6263 37.8123 22.0195 37.5647 22.2613L36.9063 22.9043L36.494 21.5532L36.6668 21.3845ZM35.3992 16.8456C35.6465 16.6038 36.0495 16.6041 36.2971 16.8456C36.5418 17.0846 36.5418 17.4835 36.2971 17.7224L35.5485 18.4534L35.1362 17.1021L35.3992 16.8456Z" fill="#303842" stroke="#303842" stroke-width="0.5"/>
                            <path d="M34.6294 32.5058L29.8487 37.1741C29.6449 37.3734 29.6312 37.7024 29.8188 37.9164C30.0284 38.1553 30.4132 38.1703 30.6411 37.9478L35.4218 33.2796C35.6407 33.0658 35.6407 32.7196 35.4218 32.5058C35.2032 32.2923 34.8483 32.2923 34.6294 32.5058Z" fill="#303842" stroke-width="0.5"/>
                            <path d="M33.0312 30.9455C33.2501 30.732 33.2501 30.3855 33.0312 30.172C32.8126 29.9583 32.4577 29.9583 32.2391 30.172L29.251 33.0895C29.0472 33.2888 29.0336 33.6178 29.2212 33.8318C29.4308 34.0708 29.8155 34.0858 30.0434 33.8633L33.0312 30.9455Z" fill="#303842" stroke-width="0.5"/>
                            <path d="M31.2385 28.0278C31.4574 27.8141 31.4574 27.4675 31.2385 27.2541C31.0196 27.0403 30.665 27.0403 30.4461 27.2541L28.3545 29.2964C28.1507 29.4955 28.1371 29.8247 28.3249 30.0388C28.5343 30.2777 28.919 30.2927 29.1469 30.0702L31.2385 28.0278Z" fill="#303842" stroke-width="0.5"/>
                            <path d="M6.73732 4.78803C6.51842 4.57456 6.16354 4.57456 5.94493 4.78803L1.16418 9.45657C0.945275 9.67004 0.945275 10.0166 1.16418 10.23C1.37989 10.4407 1.74057 10.4407 1.95657 10.23L6.73732 5.56178C6.95593 5.34803 6.95593 5.00178 6.73732 4.78803Z" fill="#303842" stroke-width="0.5"/>
                            <path d="M9.12751 7.12223C8.90861 6.90848 8.55401 6.90848 8.3354 7.12223L5.34733 10.04C5.14321 10.239 5.12987 10.568 5.31746 10.782C5.52709 11.021 5.91154 11.036 6.13943 10.8135L9.12751 7.89598C9.34641 7.68223 9.34641 7.33569 9.12751 7.12223Z" fill="#303842" stroke-width="0.5"/>
                            <path d="M9.23183 11.6891C9.44783 11.8998 9.80822 11.8998 10.0242 11.6891L12.1158 9.64674C12.3344 9.43299 12.3344 9.08674 12.1158 8.87299C11.8969 8.65952 11.5423 8.65952 11.3234 8.87299L9.23183 10.9154C9.01322 11.1291 9.01322 11.4754 9.23183 11.6891Z" fill="#303842" stroke-width="0.5"/>
                            </svg>
                            <p className="transportation__item-text">Перевозка грузов с температурным режимом</p>                           
                            <div className="transportation__item-arrow">                          
                            <svg width="12" height="11" viewBox="0 0 28 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M23.1858 11.2474C22.834 11.2474 22.6111 11.2474 22.3883 11.2474C15.5511 11.2474 8.71386 11.2474 1.8649 11.2474C1.66553 11.2474 1.47789 11.2592 1.27852 11.2474C0.50449 11.1888 0.0119279 10.708 0.000200284 9.99259C-0.0115274 9.28893 0.492762 8.77291 1.25506 8.726C1.43098 8.71427 1.60689 8.726 1.78281 8.726C8.64349 8.726 15.5042 8.726 22.3649 8.726C22.5877 8.726 22.8222 8.726 23.1741 8.726C22.9512 8.49145 22.8222 8.32726 22.6815 8.18653C20.6878 6.19283 18.7058 4.21085 16.7121 2.21715C16.243 1.73631 16.1375 1.18511 16.4072 0.669097C16.6769 0.164807 17.1226 -0.0814739 17.6738 0.0240751C17.9553 0.0827134 18.2719 0.246901 18.4713 0.446271C21.3446 3.29609 24.2061 6.15764 27.0677 9.03092C27.6775 9.64076 27.6775 10.3327 27.0677 10.9425C24.1944 13.8275 21.3211 16.7008 18.4478 19.5624C17.8849 20.1253 17.1226 20.137 16.6183 19.6445C16.0788 19.1167 16.1023 18.3779 16.7004 17.7798C18.6824 15.7861 20.6761 13.7924 22.6698 11.8104C22.8105 11.6579 22.9512 11.5055 23.1858 11.2474Z" fill="#fff"/>
                            </svg>
                            </div> 
                        </div>
                        <div className="transportation__item">                                                    
                            <svg className="transportation__item-icon" width="42" height="42" viewBox="0 0 42 42" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M33.0539 21.0001C33.0539 27.6572 27.6574 33.0537 21.0003 33.0537C14.3433 33.0537 8.94678 27.6572 8.94678 21.0001C8.94678 14.3431 14.3433 8.94657 21.0003 8.94657C27.6574 8.94657 33.0539 14.3431 33.0539 21.0001Z" stroke="#303842" stroke-width="2" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
                            <path d="M27.6981 16.9805L19.66 25.0186L14.3013 19.6598" stroke="#303842" stroke-width="2" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
                            <path d="M19.3839 1.5944C20.3143 0.801866 21.6821 0.801866 22.6125 1.5944L25.8473 4.44958L31.3214 4.02593C32.5399 3.93166 33.6466 4.73573 33.9334 5.92378L35.0309 10.4695L39.8138 13.3327C40.8549 13.9727 41.2776 15.2738 40.8114 16.4035L38.9219 20.9825L40.8114 25.5615C41.2776 26.6913 40.8549 27.9924 39.8138 28.6324L35.0309 31.4956L33.9334 36.0414C33.6466 37.2293 32.5399 38.0335 31.3214 37.9392L25.9008 37.5196L22.6125 40.4056C21.6821 41.1981 20.3143 41.1981 19.3839 40.4056L16.0956 37.5196L10.675 37.9392C9.4565 38.0335 8.34979 37.2293 8.06301 36.0414L6.96112 31.4776L2.18628 28.6324C1.14505 27.9924 0.722348 26.6913 1.18861 25.5615L3.07807 20.9825L1.18861 16.4035C0.722348 15.2738 1.14505 13.9727 2.18628 13.3327L6.55186 10.739L8.06301 5.92378C8.34979 4.73573 9.4565 3.93166 10.675 4.02593L16.1492 4.44958L19.3839 1.5944Z" stroke="#303842" stroke-width="2" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
                            </svg>                       
                            <p className="transportation__item-text">Перевозка опасных грузов</p>                           
                            <div className="transportation__item-arrow">                          
                            <svg width="12" height="11" viewBox="0 0 28 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M23.1858 11.2474C22.834 11.2474 22.6111 11.2474 22.3883 11.2474C15.5511 11.2474 8.71386 11.2474 1.8649 11.2474C1.66553 11.2474 1.47789 11.2592 1.27852 11.2474C0.50449 11.1888 0.0119279 10.708 0.000200284 9.99259C-0.0115274 9.28893 0.492762 8.77291 1.25506 8.726C1.43098 8.71427 1.60689 8.726 1.78281 8.726C8.64349 8.726 15.5042 8.726 22.3649 8.726C22.5877 8.726 22.8222 8.726 23.1741 8.726C22.9512 8.49145 22.8222 8.32726 22.6815 8.18653C20.6878 6.19283 18.7058 4.21085 16.7121 2.21715C16.243 1.73631 16.1375 1.18511 16.4072 0.669097C16.6769 0.164807 17.1226 -0.0814739 17.6738 0.0240751C17.9553 0.0827134 18.2719 0.246901 18.4713 0.446271C21.3446 3.29609 24.2061 6.15764 27.0677 9.03092C27.6775 9.64076 27.6775 10.3327 27.0677 10.9425C24.1944 13.8275 21.3211 16.7008 18.4478 19.5624C17.8849 20.1253 17.1226 20.137 16.6183 19.6445C16.0788 19.1167 16.1023 18.3779 16.7004 17.7798C18.6824 15.7861 20.6761 13.7924 22.6698 11.8104C22.8105 11.6579 22.9512 11.5055 23.1858 11.2474Z" fill="#fff"/>
                            </svg>
                            </div> 
                        </div>
                        <div className="transportation__item">                                                                                 
                            <svg className="transportation__item-icon" width="38" height="38" viewBox="0 0 38 38" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <mask id="mask0_716_6592" maskUnits="userSpaceOnUse" x="0" y="0" width="38" height="38">
                            <path d="M37 37V1H1V37H37Z" fill="white" stroke="white" stroke-width="2"/>
                            </mask>
                            <g mask="url(#mask0_716_6592)">
                            <path d="M36.8496 36.8867H1.15039V9.20787L18.9629 1.11328L36.8496 9.20787V36.8867Z" stroke="#303842" stroke-width="2" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
                            <path d="M7.45898 36.8867V14.6211H30.4668V36.8867" stroke="#303842" stroke-width="2" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
                            <path d="M7.45898 27.9805H16.3652V36.8867" stroke="#303842" stroke-width="2" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
                            </g>
                            <path d="M11.9126 27.9814V30.208" stroke="#303842" stroke-width="2" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
                            <mask id="mask1_716_6592" maskUnits="userSpaceOnUse" x="0" y="0" width="38" height="38">
                            <path d="M37 37V1H1V37H37Z" fill="white" stroke="white" stroke-width="2"/>
                            </mask>
                            <g mask="url(#mask1_716_6592)">
                            <path d="M21.5605 36.8867V27.9805H30.4668" stroke="#303842" stroke-width="2" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
                            </g>
                            <path d="M26.0142 27.9814V30.208" stroke="#303842" stroke-width="2" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
                            <path d="M7.45947 19.0752H16.3657V27.9814" stroke="#303842" stroke-width="2" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
                            <path d="M11.9126 19.0752V21.3018" stroke="#303842" stroke-width="2" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
                            <path d="M15.6235 8.68457H22.3032" stroke="#303842" stroke-width="2" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
                            </svg>
                            <p className="transportation__item-text">Дополнительные услуги</p> 
                            <div className="transportation__item-arrow">                          
                            <svg width="12" height="11" viewBox="0 0 28 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M23.1858 11.2474C22.834 11.2474 22.6111 11.2474 22.3883 11.2474C15.5511 11.2474 8.71386 11.2474 1.8649 11.2474C1.66553 11.2474 1.47789 11.2592 1.27852 11.2474C0.50449 11.1888 0.0119279 10.708 0.000200284 9.99259C-0.0115274 9.28893 0.492762 8.77291 1.25506 8.726C1.43098 8.71427 1.60689 8.726 1.78281 8.726C8.64349 8.726 15.5042 8.726 22.3649 8.726C22.5877 8.726 22.8222 8.726 23.1741 8.726C22.9512 8.49145 22.8222 8.32726 22.6815 8.18653C20.6878 6.19283 18.7058 4.21085 16.7121 2.21715C16.243 1.73631 16.1375 1.18511 16.4072 0.669097C16.6769 0.164807 17.1226 -0.0814739 17.6738 0.0240751C17.9553 0.0827134 18.2719 0.246901 18.4713 0.446271C21.3446 3.29609 24.2061 6.15764 27.0677 9.03092C27.6775 9.64076 27.6775 10.3327 27.0677 10.9425C24.1944 13.8275 21.3211 16.7008 18.4478 19.5624C17.8849 20.1253 17.1226 20.137 16.6183 19.6445C16.0788 19.1167 16.1023 18.3779 16.7004 17.7798C18.6824 15.7861 20.6761 13.7924 22.6698 11.8104C22.8105 11.6579 22.9512 11.5055 23.1858 11.2474Z" fill="#fff"/>
                            </svg>
                            </div> 
                        </div>
                        <div className="transportation__item">                                                                               
                            <svg className="transportation__item-icon" width="40" height="33" viewBox="0 0 40 33" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M4.87755 28.9H3.32653C2.04167 28.9 1 27.859 1 26.575V20.375V3.325C1 2.04098 2.04167 1 3.32653 1H23.4898C24.7747 1 25.8163 2.04098 25.8163 3.325V28.9H11.0816" stroke="#303842" stroke-width="1.55102" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
                            <path d="M28.9184 28.8994H25.8164" stroke="#303842" stroke-width="1.55102" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
                            <path d="M35.1225 28.9H36.6735C37.9586 28.9 39.0001 27.8592 39.0001 26.575V23.475V20.375V17.275L32.796 8.75H25.8164" stroke="#303842" stroke-width="1.55102" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
                            <path d="M7.97948 31.9998C9.69269 31.9998 11.0815 30.6119 11.0815 28.8998C11.0815 27.1877 9.69269 25.7998 7.97948 25.7998C6.26627 25.7998 4.87744 27.1877 4.87744 28.8998C4.87744 30.6119 6.26627 31.9998 7.97948 31.9998Z" stroke="#303842" stroke-width="1.55102" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
                            <path d="M32.0205 31.9998C33.7337 31.9998 35.1225 30.6119 35.1225 28.8998C35.1225 27.1877 33.7337 25.7998 32.0205 25.7998C30.3073 25.7998 28.9185 27.1877 28.9185 28.8998C28.9185 30.6119 30.3073 31.9998 32.0205 31.9998Z" stroke="#303842" stroke-width="1.55102" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
                            <ellipse cx="7.97961" cy="28.9" rx="0.77551" ry="0.775" fill="#303842" stroke="#303842" stroke-width="1.55102" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
                            <ellipse cx="32.0206" cy="28.9" rx="0.77551" ry="0.775" fill="#303842" stroke="#303842" stroke-width="1.55102" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
                            <path d="M6.42871 9.52559L13.4083 4.10059L20.3879 9.52559H6.42871Z" stroke="#303842" stroke-width="1.55102" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
                            <path d="M6.42871 19.5996H20.3879" stroke="#303842" stroke-width="1.55102" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
                            <path d="M18.061 9.52441V19.5994" stroke="#303842" stroke-width="1.55102" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
                            <path d="M8.75488 19.5994V9.52441" stroke="#303842" stroke-width="1.55102" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
                            <path d="M11.8569 19.6002V14.9502H14.959V19.6002" stroke="#303842" stroke-width="1.55102" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
                            <path d="M39.0001 20.375V23.475H36.6736C35.8166 23.475 35.1226 22.7814 35.1226 21.925C35.1226 21.4972 35.2963 21.1097 35.577 20.8291C35.8577 20.5486 36.2455 20.375 36.6736 20.375H39.0001Z" stroke="#303842" stroke-width="1.55102" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
                            <path d="M29.6938 8.75V17.275H39" stroke="#303842" stroke-width="1.55102" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
                            <path d="M1 22.6992H25.8163" stroke="#303842" stroke-width="1.55102" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
                            </svg>
                            <p className="transportation__item-text">Логистический консалтинг</p>
                            <div className="transportation__item-arrow">                          
                            <svg width="12" height="11" viewBox="0 0 28 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M23.1858 11.2474C22.834 11.2474 22.6111 11.2474 22.3883 11.2474C15.5511 11.2474 8.71386 11.2474 1.8649 11.2474C1.66553 11.2474 1.47789 11.2592 1.27852 11.2474C0.50449 11.1888 0.0119279 10.708 0.000200284 9.99259C-0.0115274 9.28893 0.492762 8.77291 1.25506 8.726C1.43098 8.71427 1.60689 8.726 1.78281 8.726C8.64349 8.726 15.5042 8.726 22.3649 8.726C22.5877 8.726 22.8222 8.726 23.1741 8.726C22.9512 8.49145 22.8222 8.32726 22.6815 8.18653C20.6878 6.19283 18.7058 4.21085 16.7121 2.21715C16.243 1.73631 16.1375 1.18511 16.4072 0.669097C16.6769 0.164807 17.1226 -0.0814739 17.6738 0.0240751C17.9553 0.0827134 18.2719 0.246901 18.4713 0.446271C21.3446 3.29609 24.2061 6.15764 27.0677 9.03092C27.6775 9.64076 27.6775 10.3327 27.0677 10.9425C24.1944 13.8275 21.3211 16.7008 18.4478 19.5624C17.8849 20.1253 17.1226 20.137 16.6183 19.6445C16.0788 19.1167 16.1023 18.3779 16.7004 17.7798C18.6824 15.7861 20.6761 13.7924 22.6698 11.8104C22.8105 11.6579 22.9512 11.5055 23.1858 11.2474Z" fill="#fff"/>
                            </svg>
                            </div> 
                        </div>
                    </div>
                    <div className="transportation__info">
                        <img src="../../616b6baefa48322ddcf6cd99b1f7e7a1b.png" alt="img" className="transportation__img" />
                        <h2 className="transportation__title">Автомобильные перевозки (FTL - Full Truck Load)</h2>
                        <p className="transportation__text">Мы предоставляем профессиональные услуги автомобильных перевозок, обеспечивая надежную и быструю доставку грузов по Казахстану, СНГ, Европе и Китаю. Благодаря собственному автопарку и современным технологиям мониторинга, мы гарантируем безопасность, точность и своевременность каждой перевозки.</p>
                        <div className="transportation__work">
                            <h6 className="transportation__pretitle">Как мы работаем?</h6>
                            <p className="transportation__text">1. Запрос и расчет стоимости – Вы оставляете заявку, и мы подбираем оптимальный маршрут и тариф.</p>
                            <p className="transportation__text">2. Заключение договора – Оформляем все необходимые документы.</p>
                            <p className="transportation__text">3. Забор и отправка груза – Погрузка на наш транспорт и отправка по маршруту.</p>
                            <p className="transportation__text">4. Отслеживание – Вы можете отслеживать перемещение груза в режиме онлайн.</p>
                            <p className="transportation__text">5. Доставка и разгрузка – Груз прибывает в пункт назначения в указанный срок.</p>
                        </div>
                        <div className="transportation__possibility">
                            <h5 className="transportation__title">Наши возможности</h5>
                            <div className="transportation__info-item">
                                <h6 className="transportation__pretitle">•&nbsp; Международные перевозки:</h6>
                                <p className="transportation__text">Доставка грузов между Казахстаном, Россией, СНГ, Китаем и Европой.</p>
                            </div>
                            <div className="transportation__info-item">
                                <h6 className="transportation__pretitle">•&nbsp; Региональные перевозки:</h6>
                                <p className="transportation__text">Транспортировка грузов внутри Казахстана.</p>
                            </div>
                            <div className="transportation__info-item">
                                <h6 className="transportation__pretitle">•&nbsp; Перевозка стандартных грузов:</h6>
                                <p className="transportation__text">Доставка продуктов, медикаментов и других товаров с контролем температуры</p>
                            </div>
                            <div className="transportation__info-item">
                                <h6 className="transportation__pretitle">•&nbsp; Рефрижераторные перевозки:</h6>
                                <p className="transportation__text">Доставка продуктов, медикаментов и других товаров с контролем температуры.</p>
                            </div>
                            <div className="transportation__info-item">
                                <h6 className="transportation__pretitle">•&nbsp; Перевозка негабаритных грузов</h6>
                                <p className="transportation__text">Организация логистики для крупногабаритных и тяжеловесных товаров.</p>
                            </div>
                        </div>
                        <div className="transportation__imgs">
                            <img src="../../32d4932d9a6c9f4271624dff2d96dba6.png" alt="img" className="transportation__imgs-img" />
                            <img src="../../8781a0b6c1ad62e9b1fc47bdf4150cfe.png" alt="img" className="transportation__imgs-img" />
                        </div>
                        <div className="transportation__choice">
                            <h5 className="transportation__title">Почему выбирают наши услуги автомобильных перевозок?</h5>
                            <div className="transportation__info-item">
                                <h6 className="transportation__pretitle">•&nbsp; Собственный автопарк:</h6>
                                <p className="transportation__text">50+ современных фур, соответствующих экологическим стандартам Euro-5 и Euro-6.</p>
                            </div>
                            <div className="transportation__info-item">
                                <h6 className="transportation__pretitle">•&nbsp; Современная техника:</h6>
                                <p className="transportation__text">Средний возраст автомобилей 3 года, что гарантирует надежность и минимизацию рисков поломок.</p>
                            </div>
                            <div className="transportation__info-item">
                                <h6 className="transportation__pretitle">•&nbsp; GPS-мониторинг 24/7:</h6>
                                <p className="transportation__text">Полный контроль передвижения груза в реальном времени.</p>
                            </div>
                            <div className="transportation__info-item">
                                <h6 className="transportation__pretitle">•&nbsp; Гибкость и индивидуальный подход:</h6>
                                <p className="transportation__text">Разрабатываем маршруты и логистические решения под ваши задачи.</p>
                            </div>
                            <div className="transportation__info-item">
                                <h6 className="transportation__pretitle">•&nbsp; Высокий уровень безопасности:</h6>
                                <p className="transportation__text">Тщательный контроль загрузки, крепления и соблюдения всех требований транспортировки.</p>
                            </div>
                        </div>
                        <p className="transportation__text">Мы обеспечиваем надежную и эффективную логистику, помогая вашему бизнесу работать без перебоев!</p>
                    </div>
                </div>
            </div>
        </section>
    )
}

export default Transportation;